In [1]:
import pandas as pd
import altair as alt
import numpy as np

import sqlite3 as sql

import json

# Use to handle large amount of data
# alt.data_transformers.enable('json')

In [2]:
# Machine learning model
from sklearn import metrics
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split

# Data sets used
These are the data sets used in the outline for the examples code.

In [3]:
cars_url = "https://github.com/byuidatascience/data4missing/raw/master/data-raw/mtcars_missing/mtcars_missing.json" # this gets the cars data from this url
car_db = pd.read_json(cars_url) # uses pandas read_json command to open the data set in pandas format

con = sql.connect("lahmansbaseballdb.sqlite") # allows you to us the sql data set

# Line chat 
how to get a line chat to show up in alt air

# SQL

### Explaing SQL

'SELECT' - Saying what data you want to pull

'*' - Pulls all tables

'FROM' - Which table you want to pull from

'fielding' - Table you are pulling from

'LIMIT 5' - only show '5' rows

con - sql database

In [4]:
df = pd.read_sql_query("""SELECT * 
                        FROM fielding 
                        LIMIT 5""", con)
df

,ID,playerID,yearID,stint,teamID,team_ID,lgID,POS,G,GS,InnOuts,PO,A,E,DP,PB,WP,SB,CS,ZR
0,1,abercda01,1871,1,TRO,8,NA,SS,1,1,24,1,3,2,0,None,None,None,None,None
1,2,addybo01,1871,1,RC1,7,NA,2B,22,22,606,67,72,42,5,None,None,None,None,None
2,3,addybo01,1871,1,RC1,7,NA,SS,3,3,96,8,14,7,0,None,None,None,None,None
3,4,allisar01,1871,1,CL1,3,NA,2B,2,0,18,1,4,0,0,None,None,None,None,None
4,5,allisar01,1871,1,CL1,3,NA,OF,29,29,729,51,3,7,1,None,None,None,None,None

### Creating New Dataframe

When creating a new dataframe query the data you need and set it to a new variable

The LIMIT will effect the dataframe

In [7]:
sql_dataframe_0 = pd.read_sql_query("""SELECT teamID
                                FROM Teams
                                LIMIT 5
                                """,
                                con)

sql_dataframe_0

  teamID
0    BS1
1    CH1
2    CL1
3    FW1
4    NY2

### Finding Avgerage

'ROUND' - A round function

'cast' - Converts a value to a new datatype

'ORDER BY' - Use to sort the results

'DESC' - Use to order by a descending order

In [15]:
sql_dataframe_2 = pd.read_sql_query("""SELECT playerID, yearID, ROUND(sum((cast(H as real) / ab)), 3) AS "Batting Average" 
                            FROM Batting
                            WHERE ab >= 100
                            GROUP BY playerID
                            ORDER BY "Batting Average" DESC, playerID
                            LIMIT 5
                            """,
                            con)

sql_dataframe_2

    playerID  yearID  Batting Average
0  ansonca01    1871            9.131
1   cobbty01    1905            8.663
2  henderi01    1979            7.376
3   rosepe01    1963            7.152
4  speaktr01    1908            7.104

### SQL to Altair

'SUM' - is a sum function for sql

'AS' - Renaming the column

'WHERE' - Specifying data you want to use

'OR' - standard or function

'GROUP BY' - filtering by a column

In [12]:
sql_dataframe_1 = pd.read_sql_query("""SELECT teamID, SUM(W) AS "Total Games Won"
                            FROM Teams
                            WHERE teamID = "ALT" OR teamID = "BFN"
                            GROUP BY teamID
                            LIMIT 10
                            """,
                            con)

sql_dataframe_1

  teamID  Total Games Won
0    ALT                6
1    BFN              314

#### Chart Creation

Use altair to creat a chart that was created by SQl

In [17]:
sql_chart_0 = (alt.Chart(sql_dataframe_1)
    .encode(
        x= alt.X('teamID'),
        y= alt.Y('Total Games Won'),
        color= 'teamID'
    ).mark_bar())

# Saving the chart as a png
sql_chart_0.save("screenshots/sql_chart_0.png")

sql_chart_0

alt.Chart(...)

# Markdown Notes

#### Printing tables to MD

Use the to_markdown() functions

In [8]:
print(sql_dataframe_0.to_markdown())

|    | teamID   |
|---:|:---------|
|  0 | BS1      |
|  1 | CH1      |
|  2 | CL1      |
|  3 | FW1      |
|  4 | NY2      |